# პირველი ვერსია (ცვლადებით)
def say_hi():
    name = input("What is your name? : ").strip().title()   #ჭრის ცარიელ ადგილებს სტრინგის თავში და ბოლოში. ასევე ვიზუალს უცვლის სტრინგს.
    name = name.split()                                     #იყოფა სტრინგი სიტყვებად, რის შედეგად უქმდება სიტყვებს შორის ცარიელი ადგილები.
    name = set(name)                                        #უქმდება დუბლირებული სიტყვები.
    name = ' '.join(name)                                   #აერთიანებს მიღებულ სიას ერთ სტრინგად.
    print(f"Hello, {name}, nice to meet you!")              #იბეჭდება შედეგი.
    
    
say_hi()
